/**
http://poj.org/problem?id=1000

题目：输入整数a和b，输出它们的和
题解：
这道题采用短码编程，当然有个前提是a和b的范围都不能超过9，不过这道题数据很弱，还是可以AC。
假设a和b都是个位数，n是int占4个字节，经过gets调用，n的低三个字节是a的ascii,' ',b的ascii
因为每个字节是8bit，所以n表达的整数就是(a+48）*65536 + 32*256 + （b+48）
因为a和b的范围都是个位数，所以我们可以将这个值采用取模的方式进行“降阶”
为了让a也规约到和b同一个地位，这个模数需要被65536取模余1，并且（b+48）对其取模不变。
65535 = 3*5*17*257
可以取85，可以用最小的字符满足上述情况（如果取51，满足65535%51=1，但是不满足(b+48)对其取模不变）。
所以[(a+48）*65536 + 32*256 + （b+48）] % 85 = [(a+48) + 32 + (b+48)] % 85 = [(a+b)+43] % 85
由a，b范围，可以知道[(a+b)+43]小于85
所以就有了下面的代码。

gogdizzy@gmail.com
ozy4dm@poj.org

2012-11-13 23:01  Create by gogdizzy

**/

main(n){gets(&n);printf("%d",n%85-43);}
